#include <stdio.h>


int main(void) {
	int array[5] = {6, 5, 2, 3, 1}; // 从小到大 
	// 1. 选择排序：总是找当前的最大/小值，然后跟倒数i进行交换
	// 2. 冒泡排序：如果前面的值大于后面值，前后进行交换，
	//   {6, 5, 2, 3, 1}
	//1. {5, 6, 2, 3, 1} 
	//2. {5, 2, 6, 3, 1}
	//3. {5, 2, 3, 6, 1}
	//4. {5, 2, 3, 1, 6}
	//5. {2, 5, 3, 1, 6}
	//6. {2, 3, 5, 1, 6}
	//7. {2, 3, 1, 5, 6}
	//8. {2, 1, 3, 5, 6}
	//9. {1, 2, 3, 5, 6}
	// 大数向后冒泡，小的数向前面 
	
	// 3. 插入排序：每个位置的数都要比前面的数大,否则跟前面换 
	//   {6, 5, 2, 3, 1}
	// 1. {5, 6, 2, 3, 1}
	// 2. {5, 6, 2, 3, 1}
	// 3. {5, 2, 6, 3, 1}
	// 3. {2, 5, 6, 3, 1}
	// 4. {2, 5, 3, 6, 1}
	// 5. {2, 3, 5, 6, 1}
	// 6. {2, 3, 5, 6, 1}
	// 7. {1, 2, 3, 5, 6}
	
	// 二分查找，大前提排序好的数组 
	// {1, 2, 3, 5, 6} 问有没有4
	// 常规方式：首先看数组中间值是不是4，如果不是4，那是大于还是小于4？ 
	
}
